Show / Hide Table of Contents
Class ResultOfNLA
Result of internal forces in the one position
Inheritance
System.Object
ResultBase
ResultOfNLA
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLA : ResultBase
Constructors
Improve this Doc   View Source
ResultOfNLA()
Constructor
Declaration
public ResultOfNLA()
Properties
Improve this Doc   View Source
Sections
Results in section
Declaration
public List<ResultOfNLASection> Sections { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfNLASection>
 Improve this Doc
 View Source